app/views/messages/_list.html.erb

INSERT INTO "messages" ("sender_id", "message", "status", "created_at", "updated_at") VALUES (2, 'Test', 'sent', '2011-10-12 02:18:16.803924', '2011-10-12 02:18:16.803924') RETURNING "id"
---
      <a href="#" class="hovertitle"><div class="name_msg"><%= mr.message.sender.email %></div></a>
      <div class="date_msg"><%= mr.message.created_at.strftime("%b %d, %Y at %l:%m %p") %></div>