app/controllers/billing_entities_controller.rb

  def index
    @billing_entities = if params[:active] && params[:active]=="false"
      BillingEntity.where("active IS FALSE").page(params[:page])
---
SELECT "billing_entities".* FROM "billing_entities" WHERE (active IS TRUE) LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "billing_entities" WHERE (active IS TRUE)