app/controllers/messages_controller.rb

SELECT sender_id FROM "messages" INNER JOIN "message_recipients" ON "message_recipients"."message_id" = "messages"."id" WHERE ("message_recipients"."recipient_id" = 1) GROUP BY sender_id
---
  def index
    @messages = Message.select('sender_id').joins(:message_recipients).where("message_recipients.recipient_id" => 1).group('sender_id')

INSERT INTO "message_recipients" ("message_id", "recipient_id", "status", "created_at", "updated_at") VALUES (7, 2, 'unread', '2011-10-12 02:18:16.842730', '2011-10-12 02:18:16.842730') RETURNING "id"
INSERT INTO "messages" ("sender_id", "message", "status", "created_at", "updated_at") VALUES (1, 'Test', 'sent', '2011-10-12 02:00:52.277165', '2011-10-12 02:00:52.277165') RETURNING "id"
---
  def create
    params[:message][:sender_id] = 1
    @message = Message.new(params[:message])
    @message.message_recipients << MessageRecipient.new(params[:message_recipient])

UPDATE "message_recipients" SET "status" = 'read', "updated_at" = '2011-10-12 02:25:12.020741' WHERE ("message_recipients"."id" = 1)
---
  def show
    @message_recipients = MessageRecipient.find(:all,
      :include    => :message,
      :conditions => ["(message_recipients.recipient_id = ? AND messages.sender_id = ?) or (message_recipients.recipient_id = ? AND messages.sender_id = ?) ", params[:id], 1, 1, params[:id]],
      :order      => "message_recipients.created_at ASC"
    )
    @message_recipients.each {|x| x.update_attribute(:status, "read") }